; domain
(define (domain taquin)
  (:requirements :strips :typing)

  (:types
    tile cell
  )

  (:predicates
    (at ?t - tile ?c - cell)
    (empty ?c - cell)
    (adjacent ?c1 - cell ?c2 - cell)
  )

  (:action move
    :parameters (?t - tile ?from - cell ?to - cell)
    :precondition (and
      (at ?t ?from)
      (empty ?to)
      (adjacent ?from ?to)
    )
    :effect (and
      (not (at ?t ?from))
      (at ?t ?to)
      (empty ?from)
      (not (empty ?to))
    )
  )
)

; problem
(define (problem taquin-3x3-05)
  (:domain taquin)

  (:objects
    t1 t2 t3 t4 t5 t6 t7 t8 - tile
    c1 c2 c3 c4 c5 c6 c7 c8 c9 - cell
  )

  (:init
    (adjacent c1 c2)
    (adjacent c2 c1)
    (adjacent c2 c3)
    (adjacent c3 c2)
    (adjacent c1 c4)
    (adjacent c4 c1)
    (adjacent c2 c5)
    (adjacent c5 c2)
    (adjacent c3 c6)
    (adjacent c6 c3)
    (adjacent c4 c5)
    (adjacent c5 c4)
    (adjacent c5 c6)
    (adjacent c6 c5)
    (adjacent c4 c7)
    (adjacent c7 c4)
    (adjacent c5 c8)
    (adjacent c8 c5)
    (adjacent c6 c9)
    (adjacent c9 c6)
    (adjacent c7 c8)
    (adjacent c8 c7)
    (adjacent c8 c9)
    (adjacent c9 c8)

    (at t1 c1)
    (at t2 c2)
    (at t5 c3)
    (at t7 c4)
    (empty c5)
    (at t4 c6)
    (at t3 c7)
    (at t6 c8)
    (at t8 c9)
  )

  (:goal
    (and
      (empty c1)
      (at t1 c2)
      (at t2 c3)
      (at t3 c4)
      (at t4 c5)
      (at t5 c6)
      (at t6 c7)
      (at t7 c8)
      (at t8 c9)
    )
  )
)

; plan
1. (move t4 c6 c5)
   deleted: (at t4 c6) (empty c5)
   added: (at t4 c5) (empty c6)
   goals met: 2 of 9
2. (move t5 c3 c6)
   deleted: (at t5 c3) (empty c6)
   added: (at t5 c6) (empty c3)
   goals met: 3 of 9
3. (move t2 c2 c3)
   deleted: (at t2 c2) (empty c3)
   added: (at t2 c3) (empty c2)
   goals met: 4 of 9
4. (move t4 c5 c2)
   deleted: (at t4 c5) (empty c2)
   added: (at t4 c2) (empty c5)
   goals met: 3 of 9
5. (move t7 c4 c5)
   deleted: (at t7 c4) (empty c5)
   added: (at t7 c5) (empty c4)
   goals met: 3 of 9
6. (move t3 c7 c4)
   deleted: (at t3 c7) (empty c4)
   added: (at t3 c4) (empty c7)
   goals met: 4 of 9
7. (move t6 c8 c7)
   deleted: (at t6 c8) (empty c7)
   added: (at t6 c7) (empty c8)
   goals met: 5 of 9
8. (move t7 c5 c8)
   deleted: (at t7 c5) (empty c8)
   added: (at t7 c8) (empty c5)
   goals met: 6 of 9
9. (move t4 c2 c5)
   deleted: (at t4 c2) (empty c5)
   added: (at t4 c5) (empty c2)
   goals met: 7 of 9
10. (move t1 c1 c2)
   deleted: (at t1 c1) (empty c2)
   added: (at t1 c2) (empty c1)
   goals met: 9 of 9
